{
  "name": "Eduardo David",
  "surname": "González Bermejo",
  "imageTittle": "./images/imageTittle.png",
  "title": "Software Developer",
  "profilePhotoUrl": "./images/profile-photo.jpg",
  "introduction": "There are many programming languages but, at the end, the best language for the best developer is not machine but human. I believe in teaching and learning, in communication and cooperation to evolve together and create something great.",
  "imageEmail": "./images/imageEmail.png",
  "email": "edudbermejo@gmail.com",
  "technicalSkills": [
    {
      "name": "JavaScript",
      "iconUrl": "./images/javascript.png"
    },
    {
      "name": "Typescript",
      "iconUrl": "./images/typescript.png"
    },
    {
      "name": "React",
      "iconUrl": "./images/react.png"
    },
    {
      "name": "Jest",
      "iconUrl": "./images/jest.png"
    },
    {
      "name": "Webpack",
      "iconUrl": "./images/webpack.png"
    },
    {
      "name": "Vue & Vuex",
      "iconUrl": "./images/vue.png"
    },
    {
      "name": "HTML5",
      "iconUrl": "./images/html5.png"
    },
    {
      "name": "CSS3",
      "iconUrl": "./images/css3.png"
    },
    {
      "name": "Git",
      "iconUrl": "./images/git.png"
    },
    {
      "name": "NodeJS",
      "iconUrl": "./images/nodejs.png"
    },
    {
      "name": "Docker",
      "iconUrl": "./images/docker.png"
    },
    {
      "name": "AWS",
      "iconUrl": "./images/aws.png"
    }

  ],
  "humanSkills": [
      "Curious",
      "Team player",
      "Empathetic",
      "Humble",
      "Fast learner",
      "Decisive",
      "Creative"
  ],
  "otherSkills": [
    "English High",
    "Spanish Native",
    "Agile (Scrum)"
  ],
  
  "experience": [
    {
      "name": "Zalando SE",
      "startDate": "12/2019",
      "description": "I am working in one of the many agile teams facing Zalando's partners. We constantly deploy new features to production to improve their business within Zalando, providing them with insights, more data, ways of visualising it or easy solutions for bureaucracy. I have worked as a FE in my team since I joined Zalando, using technologies like React, Typescript, jest, webpack, single-spa, and more. During some periods, I have been the only FE developer, and during others being the most senior one. In addition, I have onboarded new people into the team and mentored them. I also contribute to the community, having given talks to help hiring in Zalando, talks internally about FE concepts, and created an internal podcast for the 100+ people department that's still running after one year. In addition, I participate in doing interviews to get more talent into the company.",
      "location": "Dublin"
    },
    {
      "name": "HBC",
      "startDate": "10/2018",
      "endDate": "07/2019 (Made redundant)",
      "description": "The main project I worked on was the creation of a new CMS, using Vue, Vuex, Typescript, Node, Travis, Docker and AWS. I also created a Slack-bot that would notify the team twice a day with the pending Pull Requests and their state, as we found that they were getting lost in slack.",
      "location": "Dublin"
    },
    {
      "name": "Sopra Steria",
      "startDate": "11/2016",
      "endDate": "09/2018",
      "description": "Consultancy firm.",
      "clients": [
        {
          "name": "Model Bank (ING Spain)",
          "description": "I first entered ING Spain to work on the call centre agents' website, built using Backbone + Marionette and Stylus. I then moved to Model Bank to work on their clients' page. After a few months, I moved into a new project with Polymer (lit-html) and Redux. Alongside I also used HTML, CSS, Git and Jenkins.",
          "startDate": "03/2017",
          "endDate": "09/2018"
        },
        {
          "name": "Internal Project",
          "description": "I made a POC for internal management using Angular2.",
          "startDate": "11/2016",
          "endDate": "02/2017"
        }
      ],
      "location": "Madrid"
    },
    {
      "name": "Altran",
      "startDate": "08/2015",
      "endDate": "10/2016",
      "description": "Consultancy firm.",
      "clients": [
      {
        "name": "Caser Seguros",
        "description": "Using mostly AngularJS, the customer wanted to make a survey to know how the clients have felt about some service the insurance company had provided.",
        "startDate": "06/2016",
        "endDate": "10/2016"
        },
        {
          "name": "Internal Project",
          "description": "I used Angular, Sass, Gulp, Ionic and Git to build some parts of a mobile app the company wanted to sell to an insurance brand aiming for people having a healthier life.",
          "startDate": "02/2016",
          "endDate": "06/2016"
        },
        {
          "name": "Banco Santander",
          "description": "The first project I become part of was for Leasing & Renting. Tech stack was Java, Spring, Maven and Subversion for the version control.",
          "startDate": "08/2015",
          "endDate": "02/2016"
        }
      ],
      "location": "Madrid"
    },
    {
      "name": "Universidad Politécnica de Madrid (Distributed Systems Department)",
      "startDate": "09/2014",
      "endDate": "06/2015",
      "description": "The main pillar of the project was Zookeeper. We wanted to create a distributed architecture that would always maintain a correct state in a distributed system. I used a Linux environment, Java, Gradle and HAProxy.",
      "location": "Madrid"
    }
  ],
  "education": [
    {
      "name": "Computer Engineering Degree",
      "place": "Universidad Politécnica de Madrid",
      "startDate": "2011",
      "endDate": "2015 (Incomplete)"
    }
  ]

}
